#+TITLE: Generating (Secure) Pseudo-Random Data with SPARKLE512
#+Time-stamp: <2024-08-26 20:55:39 leo>


#+OPTIONS: html-style:nil toc:2 num:t
#+HTML_HEAD: <link href="../style.css" rel="stylesheet" type="text/css" /> <link rel="stylesheet" href="https://files.inria.fr/dircom/extranet/fonts-inria-sans.css"> <link rel="stylesheet" href="https://files.inria.fr/dircom/extranet/fonts-inria-serif.css">
#+HTML_HEAD: <script type="text/javascript" async src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.5/latest.js?config=TeX-MML-AM_CHTML"> </script>


#+HTML_LINK_UP: <ignored>

#+BEGIN_SRC elisp :exports none
(defun reset-formats(backend)
  (setq org-html-home/up-format "
  <div id=\"org-div-home-and-up\">
      <a href=\"https://www.rocq.inria.fr/secret/index.php\">Cosmiq Homepage</a>
      |
      <a href=\"../index.html\">Léo Perrin's Homepage</a>
      |
      <a href=\"./rescale.html\">ReSCALE</a>
  </div>")
  (setq org-html-postamble (concat "<p class=\"date\">Last Update (by me): "
                                   (format-time-string "%d/%m/%Y")
                                   "</p>"))
  )

(add-hook 'org-export-before-parsing-hook 'reset-formats)

(org-html-export-to-html)
#+END_SRC

#+RESULTS:
: sparklyRG.html


*** Rejection Sampling
Using the =get_n_bit_unsigned_integer= function, it is then easy to
return outputs in a specific range. We use rejection sampling to avoid
any trivial bias. In order for it to work, we need to get the
bit-length of the desired output. Instead of using a logarithm, we can
do some bit-fiddling using the =__builtin_clz= function (or, in this
case, its long long variant). It is =GCC= specific, and its behaviour is
explained in the [[https://gcc.gnu.org/onlinedocs/gcc-4.8.0/gcc/Other-Builtins.html][GCC manual]]: it returns the number of high-bit
trailing zeroes in the binary representation. To better see it, we
evaluate it on some small integers.

#+BEGIN_SRC C++ :flags -std=c++17
#include<iostream>
#include<cstdint>

int main(int argc, char ** argv)
{
    for (uint64_t i=1; i<67; i+=5)
        std::cout << "|" << i << "|" << 64-__builtin_clzll(i) << std::endl;
}
#+END_SRC

#+RESULTS:
|   |  1 | 1 |
|   |  6 | 3 |
|   | 11 | 4 |
|   | 16 | 5 |
|   | 21 | 5 |
|   | 26 | 5 |
|   | 31 | 5 |
|   | 36 | 6 |
|   | 41 | 6 |
|   | 46 | 6 |
|   | 51 | 6 |
|   | 56 | 6 |
|   | 61 | 6 |
|   | 66 | 7 |

It does what we need! Writing the function =get_integer_in_range= is
then trivial.

#+BEGIN_SRC cpp :tangle sparklyRG/sparkle512.cpp :main no
uint64_t Sparkle512core::get_unsigned_integer_in_range(
    const uint64_t lower_bound,
    const uint64_t upper_bound)
{
    uint64_t
        bit_length = 64 - __builtin_clzll(upper_bound - lower_bound),
        range = upper_bound - lower_bound,
        output ;
    do
    {
        output = get_n_bit_unsigned_integer(bit_length);
    } while (output >= range) ;
    return lower_bound + output;    
}
#+END_SRC

Initializing `ouput` to a first output of =get_n_bit_unsigned_integer=
and then using a "regular" =while= loop seems to yield a slightly slower
PRNG.
